Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ06GS101.h
/* RPINR32 */
#define _FLT6R RPINR32bits.FLT6R
#define _FLT7R RPINR32bits.FLT7R
#define _FLT6R0 RPINR32bits.FLT6R0
#define _FLT6R1 RPINR32bits.FLT6R1
#define _FLT6R2 RPINR32bits.FLT6R2
#define _FLT6R3 RPINR32bits.FLT6R3
#define _FLT6R4 RPINR32bits.FLT6R4
#define _FLT6R5 RPINR32bits.FLT6R5
#define _FLT7R0 RPINR32bits.FLT7R0
#define _FLT7R1 RPINR32bits.FLT7R1
#define _FLT7R2 RPINR32bits.FLT7R2
#define _FLT7R3 RPINR32bits.FLT7R3
#define _FLT7R4 RPINR32bits.FLT7R4
#define _FLT7R5 RPINR32bits.FLT7R5

/* RPINR33 */
#define _FLT8R RPINR33bits.FLT8R
#define _SYNCI1R RPINR33bits.SYNCI1R
#define _FLT8R0 RPINR33bits.FLT8R0
#define _FLT8R1 RPINR33bits.FLT8R1
#define _FLT8R2 RPINR33bits.FLT8R2
#define _FLT8R3 RPINR33bits.FLT8R3
#define _FLT8R4 RPINR33bits.FLT8R4
#define _FLT8R5 RPINR33bits.FLT8R5
#define _SYNCI1R0 RPINR33bits.SYNCI1R0
#define _SYNCI1R1 RPINR33bits.SYNCI1R1
#define _SYNCI1R2 RPINR33bits.SYNCI1R2
#define _SYNCI1R3 RPINR33bits.SYNCI1R3
#define _SYNCI1R4 RPINR33bits.SYNCI1R4
#define _SYNCI1R5 RPINR33bits.SYNCI1R5

/* RPINR34 */
#define _SYNCI2R RPINR34bits.SYNCI2R
#define _SYNCI2R0 RPINR34bits.SYNCI2R0
#define _SYNCI2R1 RPINR34bits.SYNCI2R1
#define _SYNCI2R2 RPINR34bits.SYNCI2R2
#define _SYNCI2R3 RPINR34bits.SYNCI2R3
#define _SYNCI2R4 RPINR34bits.SYNCI2R4
#define _SYNCI2R5 RPINR34bits.SYNCI2R5

/* RPOR0 */
#define _RP0R RPOR0bits.RP0R
#define _RP1R RPOR0bits.RP1R
#define _RP0R0 RPOR0bits.RP0R0
#define _RP0R1 RPOR0bits.RP0R1
#define _RP0R2 RPOR0bits.RP0R2
#define _RP0R3 RPOR0bits.RP0R3
#define _RP0R4 RPOR0bits.RP0R4
#define _RP0R5 RPOR0bits.RP0R5
#define _RP1R0 RPOR0bits.RP1R0
#define _RP1R1 RPOR0bits.RP1R1
#define _RP1R2 RPOR0bits.RP1R2
#define _RP1R3 RPOR0bits.RP1R3
#define _RP1R4 RPOR0bits.RP1R4
#define _RP1R5 RPOR0bits.RP1R5

/* RPOR1 */
#define _RP2R RPOR1bits.RP2R
#define _RP3R RPOR1bits.RP3R
#define _RP2R0 RPOR1bits.RP2R0
#define _RP2R1 RPOR1bits.RP2R1
#define _RP2R2 RPOR1bits.RP2R2
#define _RP2R3 RPOR1bits.RP2R3
#define _RP2R4 RPOR1bits.RP2R4
#define _RP2R5 RPOR1bits.RP2R5
#define _RP3R0 RPOR1bits.RP3R0
#define _RP3R1 RPOR1bits.RP3R1
#define _RP3R2 RPOR1bits.RP3R2
#define _RP3R3 RPOR1bits.RP3R3
#define _RP3R4 RPOR1bits.RP3R4
#define _RP3R5 RPOR1bits.RP3R5

/* RPOR2 */
#define _RP4R RPOR2bits.RP4R
#define _RP5R RPOR2bits.RP5R
#define _RP4R0 RPOR2bits.RP4R0
#define _RP4R1 RPOR2bits.RP4R1
#define _RP4R2 RPOR2bits.RP4R2
#define _RP4R3 RPOR2bits.RP4R3
#define _RP4R4 RPOR2bits.RP4R4
#define _RP4R5 RPOR2bits.RP4R5
#define _RP5R0 RPOR2bits.RP5R0
#define _RP5R1 RPOR2bits.RP5R1
#define _RP5R2 RPOR2bits.RP5R2
#define _RP5R3 RPOR2bits.RP5R3
#define _RP5R4 RPOR2bits.RP5R4
#define _RP5R5 RPOR2bits.RP5R5

/* RPOR3 */
#define _RP6R RPOR3bits.RP6R
#define _RP7R RPOR3bits.RP7R
#define _RP6R0 RPOR3bits.RP6R0
#define _RP6R1 RPOR3bits.RP6R1
#define _RP6R2 RPOR3bits.RP6R2
#define _RP6R3 RPOR3bits.RP6R3
#define _RP6R4 RPOR3bits.RP6R4
#define _RP6R5 RPOR3bits.RP6R5
#define _RP7R0 RPOR3bits.RP7R0
#define _RP7R1 RPOR3bits.RP7R1
#define _RP7R2 RPOR3bits.RP7R2
#define _RP7R3 RPOR3bits.RP7R3
#define _RP7R4 RPOR3bits.RP7R4
#define _RP7R5 RPOR3bits.RP7R5

/* RPOR16 */
#define _RP32R RPOR16bits.RP32R
#define _RP33R RPOR16bits.RP33R
#define _RP32R0 RPOR16bits.RP32R0
#define _RP32R1 RPOR16bits.RP32R1
#define _RP32R2 RPOR16bits.RP32R2
#define _RP32R3 RPOR16bits.RP32R3
#define _RP32R4 RPOR16bits.RP32R4
#define _RP32R5 RPOR16bits.RP32R5
#define _RP33R0 RPOR16bits.RP33R0
#define _RP33R1 RPOR16bits.RP33R1
#define _RP33R2 RPOR16bits.RP33R2
#define _RP33R3 RPOR16bits.RP33R3
#define _RP33R4 RPOR16bits.RP33R4
#define _RP33R5 RPOR16bits.RP33R5

/* RPOR17 */
#define _RP34R RPOR17bits.RP34R
#define _RP35R RPOR17bits.RP35R
#define _RP34R0 RPOR17bits.RP34R0
#define _RP34R1 RPOR17bits.RP34R1
#define _RP34R2 RPOR17bits.RP34R2
#define _RP34R3 RPOR17bits.RP34R3
#define _RP34R4 RPOR17bits.RP34R4
#define _RP34R5 RPOR17bits.RP34R5
#define _RP35R0 RPOR17bits.RP35R0
#define _RP35R1 RPOR17bits.RP35R1
#define _RP35R2 RPOR17bits.RP35R2
#define _RP35R3 RPOR17bits.RP35R3
#define _RP35R4 RPOR17bits.RP35R4
#define _RP35R5 RPOR17bits.RP35R5

/* RCON */
#define _POR RCONbits.POR
#define _BOR RCONbits.BOR
#define _IDLE RCONbits.IDLE
#define _SLEEP RCONbits.SLEEP
#define _WDTO RCONbits.WDTO
#define _SWDTEN RCONbits.SWDTEN
#define _SWR RCONbits.SWR
#define _EXTR RCONbits.EXTR
#define _VREGS RCONbits.VREGS
#define _CM RCONbits.CM
#define _IOPUWR RCONbits.IOPUWR
#define _TRAPR RCONbits.TRAPR

/* OSCCON */
#define _OSWEN OSCCONbits.OSWEN
#define _CF OSCCONbits.CF
#define _LOCK OSCCONbits.LOCK
#define _IOLOCK OSCCONbits.IOLOCK
#define _CLKLOCK OSCCONbits.CLKLOCK
#define _NOSC OSCCONbits.NOSC
#define _COSC OSCCONbits.COSC
#define _NOSC0 OSCCONbits.NOSC0
#define _NOSC1 OSCCONbits.NOSC1
#define _NOSC2 OSCCONbits.NOSC2
#define _COSC0 OSCCONbits.COSC0
#define _COSC1 OSCCONbits.COSC1
#define _COSC2 OSCCONbits.COSC2

/* CLKDIV */
#define _PLLPRE CLKDIVbits.PLLPRE
#define _PLLPOST CLKDIVbits.PLLPOST
#define _FRCDIV CLKDIVbits.FRCDIV
#define _DOZEN CLKDIVbits.DOZEN
#define _DOZE CLKDIVbits.DOZE
#define _ROI CLKDIVbits.ROI
#define _PLLPRE0 CLKDIVbits.PLLPRE0
#define _PLLPRE1 CLKDIVbits.PLLPRE1
#define _PLLPRE2 CLKDIVbits.PLLPRE2
#define _PLLPRE3 CLKDIVbits.PLLPRE3
#define _PLLPRE4 CLKDIVbits.PLLPRE4
#define _PLLPOST0 CLKDIVbits.PLLPOST0
#define _PLLPOST1 CLKDIVbits.PLLPOST1
#define _FRCDIV0 CLKDIVbits.FRCDIV0
#define _FRCDIV1 CLKDIVbits.FRCDIV1
#define _FRCDIV2 CLKDIVbits.FRCDIV2
#define _DOZE0 CLKDIVbits.DOZE0
#define _DOZE1 CLKDIVbits.DOZE1
#define _DOZE2 CLKDIVbits.DOZE2

/* PLLFBD */
#define _PLLDIV PLLFBDbits.PLLDIV
#define _PLLDIV0 PLLFBDbits.PLLDIV0
#define _PLLDIV1 PLLFBDbits.PLLDIV1
#define _PLLDIV2 PLLFBDbits.PLLDIV2
#define _PLLDIV3 PLLFBDbits.PLLDIV3
#define _PLLDIV4 PLLFBDbits.PLLDIV4
#define _PLLDIV5 PLLFBDbits.PLLDIV5
#define _PLLDIV6 PLLFBDbits.PLLDIV6
#define _PLLDIV7 PLLFBDbits.PLLDIV7
#define _PLLDIV8 PLLFBDbits.PLLDIV8

/* OSCTUN */
#define _TUN OSCTUNbits.TUN
#define _TUN0 OSCTUNbits.TUN0
#define _TUN1 OSCTUNbits.TUN1
#define _TUN2 OSCTUNbits.TUN2
#define _TUN3 OSCTUNbits.TUN3
#define _TUN4 OSCTUNbits.TUN4
#define _TUN5 OSCTUNbits.TUN5

/* REFOCON */
#define _RODIV REFOCONbits.RODIV
#define _ROSEL REFOCONbits.ROSEL
#define _ROSIDL REFOCONbits.ROSIDL
#define _ROON REFOCONbits.ROON
#define _RODIV0 REFOCONbits.RODIV0
#define _RODIV1 REFOCONbits.RODIV1
#define _RODIV2 REFOCONbits.RODIV2
#define _RODIV3 REFOCONbits.RODIV3
#define _ROSSLP REFOCONbits.ROSSLP

