Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ06GS101.h
#define _RPOR2_RP5R3_POSITION                    0x0000000B
#define _RPOR2_RP5R3_MASK                        0x00000800
#define _RPOR2_RP5R3_LENGTH                      0x00000001

#define _RPOR2_RP5R4_POSITION                    0x0000000C
#define _RPOR2_RP5R4_MASK                        0x00001000
#define _RPOR2_RP5R4_LENGTH                      0x00000001

#define _RPOR2_RP5R5_POSITION                    0x0000000D
#define _RPOR2_RP5R5_MASK                        0x00002000
#define _RPOR2_RP5R5_LENGTH                      0x00000001

#define _RPOR3_RP6R_POSITION                     0x00000000
#define _RPOR3_RP6R_MASK                         0x0000003F
#define _RPOR3_RP6R_LENGTH                       0x00000006

#define _RPOR3_RP7R_POSITION                     0x00000008
#define _RPOR3_RP7R_MASK                         0x00003F00
#define _RPOR3_RP7R_LENGTH                       0x00000006

#define _RPOR3_RP6R0_POSITION                    0x00000000
#define _RPOR3_RP6R0_MASK                        0x00000001
#define _RPOR3_RP6R0_LENGTH                      0x00000001

#define _RPOR3_RP6R1_POSITION                    0x00000001
#define _RPOR3_RP6R1_MASK                        0x00000002
#define _RPOR3_RP6R1_LENGTH                      0x00000001

#define _RPOR3_RP6R2_POSITION                    0x00000002
#define _RPOR3_RP6R2_MASK                        0x00000004
#define _RPOR3_RP6R2_LENGTH                      0x00000001

#define _RPOR3_RP6R3_POSITION                    0x00000003
#define _RPOR3_RP6R3_MASK                        0x00000008
#define _RPOR3_RP6R3_LENGTH                      0x00000001

#define _RPOR3_RP6R4_POSITION                    0x00000004
#define _RPOR3_RP6R4_MASK                        0x00000010
#define _RPOR3_RP6R4_LENGTH                      0x00000001

#define _RPOR3_RP6R5_POSITION                    0x00000005
#define _RPOR3_RP6R5_MASK                        0x00000020
#define _RPOR3_RP6R5_LENGTH                      0x00000001

#define _RPOR3_RP7R0_POSITION                    0x00000008
#define _RPOR3_RP7R0_MASK                        0x00000100
#define _RPOR3_RP7R0_LENGTH                      0x00000001

#define _RPOR3_RP7R1_POSITION                    0x00000009
#define _RPOR3_RP7R1_MASK                        0x00000200
#define _RPOR3_RP7R1_LENGTH                      0x00000001

#define _RPOR3_RP7R2_POSITION                    0x0000000A
#define _RPOR3_RP7R2_MASK                        0x00000400
#define _RPOR3_RP7R2_LENGTH                      0x00000001

#define _RPOR3_RP7R3_POSITION                    0x0000000B
#define _RPOR3_RP7R3_MASK                        0x00000800
#define _RPOR3_RP7R3_LENGTH                      0x00000001

#define _RPOR3_RP7R4_POSITION                    0x0000000C
#define _RPOR3_RP7R4_MASK                        0x00001000
#define _RPOR3_RP7R4_LENGTH                      0x00000001

#define _RPOR3_RP7R5_POSITION                    0x0000000D
#define _RPOR3_RP7R5_MASK                        0x00002000
#define _RPOR3_RP7R5_LENGTH                      0x00000001

#define _RPOR16_RP32R_POSITION                   0x00000000
#define _RPOR16_RP32R_MASK                       0x0000003F
#define _RPOR16_RP32R_LENGTH                     0x00000006

#define _RPOR16_RP33R_POSITION                   0x00000008
#define _RPOR16_RP33R_MASK                       0x00003F00
#define _RPOR16_RP33R_LENGTH                     0x00000006

#define _RPOR16_RP32R0_POSITION                  0x00000000
#define _RPOR16_RP32R0_MASK                      0x00000001
#define _RPOR16_RP32R0_LENGTH                    0x00000001

#define _RPOR16_RP32R1_POSITION                  0x00000001
#define _RPOR16_RP32R1_MASK                      0x00000002
#define _RPOR16_RP32R1_LENGTH                    0x00000001

#define _RPOR16_RP32R2_POSITION                  0x00000002
#define _RPOR16_RP32R2_MASK                      0x00000004
#define _RPOR16_RP32R2_LENGTH                    0x00000001

#define _RPOR16_RP32R3_POSITION                  0x00000003
#define _RPOR16_RP32R3_MASK                      0x00000008
#define _RPOR16_RP32R3_LENGTH                    0x00000001

#define _RPOR16_RP32R4_POSITION                  0x00000004
#define _RPOR16_RP32R4_MASK                      0x00000010
#define _RPOR16_RP32R4_LENGTH                    0x00000001

#define _RPOR16_RP32R5_POSITION                  0x00000005
#define _RPOR16_RP32R5_MASK                      0x00000020
#define _RPOR16_RP32R5_LENGTH                    0x00000001

#define _RPOR16_RP33R0_POSITION                  0x00000008
#define _RPOR16_RP33R0_MASK                      0x00000100
#define _RPOR16_RP33R0_LENGTH                    0x00000001

#define _RPOR16_RP33R1_POSITION                  0x00000009
#define _RPOR16_RP33R1_MASK                      0x00000200
#define _RPOR16_RP33R1_LENGTH                    0x00000001

#define _RPOR16_RP33R2_POSITION                  0x0000000A
#define _RPOR16_RP33R2_MASK                      0x00000400
#define _RPOR16_RP33R2_LENGTH                    0x00000001

#define _RPOR16_RP33R3_POSITION                  0x0000000B
#define _RPOR16_RP33R3_MASK                      0x00000800
#define _RPOR16_RP33R3_LENGTH                    0x00000001

#define _RPOR16_RP33R4_POSITION                  0x0000000C
#define _RPOR16_RP33R4_MASK                      0x00001000
#define _RPOR16_RP33R4_LENGTH                    0x00000001

#define _RPOR16_RP33R5_POSITION                  0x0000000D
#define _RPOR16_RP33R5_MASK                      0x00002000
#define _RPOR16_RP33R5_LENGTH                    0x00000001

#define _RPOR17_RP34R_POSITION                   0x00000000
#define _RPOR17_RP34R_MASK                       0x0000003F
#define _RPOR17_RP34R_LENGTH                     0x00000006

#define _RPOR17_RP35R_POSITION                   0x00000008
#define _RPOR17_RP35R_MASK                       0x00003F00
#define _RPOR17_RP35R_LENGTH                     0x00000006

#define _RPOR17_RP34R0_POSITION                  0x00000000
#define _RPOR17_RP34R0_MASK                      0x00000001
#define _RPOR17_RP34R0_LENGTH                    0x00000001

#define _RPOR17_RP34R1_POSITION                  0x00000001
#define _RPOR17_RP34R1_MASK                      0x00000002
#define _RPOR17_RP34R1_LENGTH                    0x00000001

#define _RPOR17_RP34R2_POSITION                  0x00000002
#define _RPOR17_RP34R2_MASK                      0x00000004
#define _RPOR17_RP34R2_LENGTH                    0x00000001

#define _RPOR17_RP34R3_POSITION                  0x00000003
#define _RPOR17_RP34R3_MASK                      0x00000008
#define _RPOR17_RP34R3_LENGTH                    0x00000001

